// 개인정보 수집 및 이용 동의 내용
const privacyContent =
    '개인정보 수집목적 및 이용목적\n' +
    '\n' +
    '(1) 홈페이지 회원 가입 및 관리\n' +
    '회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별․인증, 회원자격 유지․관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정 이용 방지, 만 14세 미만 아동의 개인정보 처리 시 법정대리인의 동의 여부 확인, 각종 고지․통지, 고충 처리 등의 목적\n' +
    '\n' +
    '(2) 재화 또는 서비스 제공\n' +
    '3D 프린팅 출력물 제작, 상품 배송, 견적 상담, 서비스 제공, 계약서․청구서 발송, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 연령인증, 요금 결제 및 정산, 채권추심 등의 목적\n' +
    '\n' +
    '(3) 고충 처리\n' +
    '민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락․통지, 처리 결과 통보 등\n' +
    '\n' +
    '수집하는 개인정보 항목\n' +
    '\n' +
    'ID, 성명, 비밀번호, 주소, 휴대폰 번호, 이메일, 주문/배송 정보, 결제 정보, 14세 미만 가입자의 경우 법정대리인 정보\n' +
    '\n' +
    '개인정보 보유 및 이용기간\n' +
    '\n' +
    '회원탈퇴 시까지 보유합니다. 다만, 관계 법령에 따라 보존할 필요가 있는 경우 해당 법령에서 정한 기간 동안 보관하며, 자세한 사항은 개인정보처리방침에서 확인할 수 있습니다.'

export default privacyContent;
